       ID DIVISION.
       PROGRAM-ID.   HELLOWO1.

       DATA DIVISION.

       WORKING-STORAGE SECTION.

       PROCEDURE DIVISION.

           DISPLAY 'HELLO, WORLD!'.

           DISPLAY 'HI'.

           DISPLAY 'inserted line above'.
           DISPLAY 'HELLO, sir'.
           DISPLAY 'this is a new line'.

           DISPLAY 'GOODBYE'.

      *

      * test for git

           GOBACK.