       ID DIVISION.
       PROGRAM-ID.   HELLOWO1.

       DATA DIVISION.

       WORKING-STORAGE SECTION.

       PROCEDURE DIVISION.

           DISPLAY 'HELLO, WORLD!'.

           DISPLAY 'HI'.

           DISPLAY 'HELLO'.

           DISPLAY 'GOODBYE'.

           GOBACK.